'''
Создать список из N элементов (от 0 до n с шагом 1).
В этом списке вывести все четные значения.
'''

# n = [i for i in range(0, 100) if i%2 == 0]
# print(n)
n = list (range (0, 100))
for i in n:
    if i%2 == 0:
        print(i)


