'''Реализовать функцию bank, которая приннимает следующие
аргументы: сумма депозита, кол-во лет, и процент. Результатом
выполнения должна быть сумма по истечению депозита'''


def bank(x, y, z):
    return x*(1+z/100)**y


depsum = bank(10, 2, 10)
print(depsum)